Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_UsingSwiftWithCocoaAndObjective-C/Swift_BCA-level2.tmx
Source language: en_us
Languages: ja

source: Fill out an Objective-C bridging header if you need to access Objective-C code from the same app target in your Swift file.
ja: あなたがあなたのスウィフトファイルにおいて同じアプリターゲットからのObjective-Cコードにアクセスする必要があるならば、Objective-C橋渡しヘッダに記入してください。

source: Fixed the NS_SWIFT_NAME example from the Overriding Swift Names for Objective-C Interfaces section in the Swift and Objective-C in the Same Project chapter.
ja: Objective-Cインターフェイスのためのスウィフト名のオーバーライド節のNS_SWIFT_NAME例を同じプロジェクト中のスウィフトとObjective-C章において修正した。

source: Fixed the UIBezierPath example to correctly create a triangle.
ja: UIBezierPath例を直して、正しく三角形を作成できるようにした。

source: Fixed the examples for NS_STRING_ENUM and NS_EXTENSIBLE_STRING_ENUM in the Imported Constant Enumerations and Structures section.
ja: NS_STRING_ENUMとNS_EXTENSIBLE_STRING_ENUMのための例をインポートされる定数列挙と構造体の節において修正した。

source: For a list, see Using Swift from Objective-C.
ja: その一覧のために、スウィフトをObjective-Cから使うを見てください。

source: For a short list of practices to adopt before moving forward, see Adopting Modern Objective-C.
ja: 前進する前に採用するべき短い慣行リストとして、現代のObjective-Cを採用するを見てください。

source: For a straightforward, incremental migration of an app, you’ll be using the tools learned earlier—mix and match plus interoperability.
ja: アプリのわかりやすい、徐々に進める移動のために、あなたは以前に学んだいくつかの手段を使用することになります ― 混合と適合それに相互運用性。

source: For an example of using target-action in Swift code, see Selectors.
ja: スウィフトコードにおいてターゲット-アクションを使う例のために、セレクタを見てください。

source: For an unspecialized Objective-C type, Swift infers the generic parameterization for the imported class type constraints.
ja: 特殊化されないObjective-C型に対して、スウィフトは総称体パラメータ化をインポートされたクラス型制約に対して推測します。

source: For app targets, declarations marked with the internal modifier appear in the generated header if the app target has an Objective-C bridging header.
ja: アプリターゲットでは、internal修飾子で印される宣言は、そのアプリターゲットがObjective-C橋渡しヘッダを持つならば、生成ヘッダの中に現れます。

source: For class types, the following mappings apply:
ja: クラス型のために、以下のマッピングが適用されます：

source: For considerations on translating your properties from Objective-C to Swift, read Properties in The Swift Programming Language (Swift 4).
ja: スウィフトにあなたのプロパティをObjective-Cから翻訳することでの配慮について、プロパティをスウィフトプログラミング言語（Swift 4）で読んでください。

source: For consistency and simplicity, Objective-C class factory methods are imported as convenience initializers in Swift.
ja: 一貫性と単純さのために、Objective-Cクラスファクトリメソッドは、便宜イニシャライザとしてスウィフトにインポートされます。

source: For example, NSString ** comes over to Swift as AutoreleasingUnsafeMutablePointer<NSString?>, not AutoreleasingUnsafeMutablePointer<String?>.
ja: 例えば、NSString **はスウィフトにAutoreleasingUnsafeMutablePointer<NSString?>としてやってきます、AutoreleasingUnsafeMutablePointer<String?>ではなく。

source: For example, a function pointer that has the type int (*)(void) in C is imported into Swift as @convention(c) () -> Int32.
ja: 例えば、Cにおけるint (*)(void)型をもつ関数ポインターは、スウィフトに@convention(c) () -> Int32としてインポートされます。

source: For example, an Objective-C class providing a convenience initializer that takes variadic arguments for keys-value pairs may advise a Swift consumer to use a dictionary literal instead:
ja: 例えば、あるObjective-Cクラスは便利なイニシャライザを提供していて、それは可変長引数をキー-値ペアに対して取るもので、スウィフト消費者に勧めるのは代わりに1つの辞書を使うことです：

source: For example, an app that communicates with a web server would receive JSON representations of grocery products, such as:
ja: 例えば、あるアプリでウェブサーバと通信するものは、日用製品のJSON表現を受け取るでしょう、このように：

source: For example, casting an NSNumber value representing the number 500 to the Int8 Swift type will fail and return nil, because the largest value that an Int8 value can represent is 127.
ja: 例えば、数500を表しているNSNumber値をInt8のSwift型へキャストすることは失敗してnilを返します、なぜならInt8値が表すことができる最大値は127だからです。

source: For example, consider Core Foundation’s CFArrayCreateMutable(_:_:_:) function.
ja: 例えば、Core FoundationのCFArrayCreateMutable(_:_:_:)関数を考えてみてください。

source: For example, consider a C structure named Cake that contains the fields layers and height nested within an unnamed union type, and a field toppings of an unnamed struct type:
ja: 例えば、Cakeと名前を付けられるC構造体を考えてください、それはフィールドlayersおよびheightを無名のunion型内部に、そして無名struct型のフィールドtoppingsを含みます：

source: For example, consider a C union named SchroedingersCat that has an isAlive and an isDead field:
ja: 例えば、SchroedingersCatと名前を付けられるC共用体を考えてください、それはisAliveとisDeadフィールドを持ちます：

source: For example, consider a Core Data entity called “Person” with a String attribute “name” and a to-many relationship “friends”:
ja: 例えば、あるコアデータ・エントリ、「Person」と呼ばれて、String属性「name」と対多リレーションシップ「friends」をもつものを考えてみてください：

source: For example, consider a simple Task model, which is used by a ToDoListController to display a list of tasks to complete:
ja: 例えば、単純なTaskモデルを考えてください、それはToDoListControllerによって使われて完了するべきタスク（作業）のリストを表示します：

source: For example, consider the read(from:ofType:) method in NSDocument.
ja: 例として、NSDocumentのread(from:ofType:)メソッドを考えてください。

source: For example, consider the following C function declarations:
ja: 例えば、以下のC関数定義を考えてみてください：

source: For example, consider the following Objective-C declarations for integer constants of type TrafficLightColor:
ja: 例えば、型TrafficLightColorの整数定数のための以下のObjective-C宣言を考えてみてください：

source: For example, consider the following Objective-C declarations that represent sets of actively illuminated colors on a traffic light:
ja: 例えば、信号機上で活発に変わる照明された色の一揃いを表す以下のObjective-C宣言を考えてみてください：

source: For example, consider the following Objective-C declarations:
ja: 例として、以下のObjective-C宣言を考えてください：

source: For example, consider the following Objective-C method from NSFileManager:
ja: 例として、以下のNSFileManagerからのObjective-Cメソッドを考えてください：

source: For example, consider the following Objective-C options declaration:
ja: 例として、以下のObjective-Cオプション定義を考えてみてください。

source: For example, consider the following Swift declaration:
ja: 例として、以下のスウィフト宣言を考えてください：

source: For example, given the following C function declarations:
ja: 例えば、以下のC関数定義を与えられて：

source: For example, given the following C structure:
ja: 例えば、以下のC構造体を与えられて：

source: For example, given the following Objective-C class and category declarations:
ja: 例えば、以下のObjective-Cクラスおよびカテゴリ定義を与えられて：

source: For example, given the following Objective-C declarations:
ja: 例えば、以下のObjective-C宣言を与えられて：

source: For example, given the following Objective-C method that performs an operation on the specified class:
ja: 例えば、指定されたクラス上である演算を実行する以下のObjective-Cメソッドを与えられて：

source: For example, given the following Objective-C property declarations:
ja: 例えば、以下のObjective-Cプロパティを与えられて：

source: For example, given the following Objective-C property that refers to a view controller:
ja: 例えば、あるビューコントローラを参照する以下のObjective-Cプロパティを与えられて：

source: For example, given the following Swift enumeration declaration:
ja: 例えば、以下のスウィフト列挙宣言を与えられたとして：

source: For example, here is an Objective-C block variable:
ja: 例えば、ひとつのObjective-Cブロック変数がここにあります：

source: For example, here’s an unannotated C function:
ja: 例えば、ここに注釈をつけられなかったC関数があります：

source: For example, here’s how to call the vasprintf function in Swift:
ja: 例えば、ここにvasprintf関数をスウィフトにおいて呼び出す方法があります：

source: For example, if the name of your Swift class contains a character that isn’t supported by Objective-C, you can provide an alternative name to use in Objective-C.
ja: 例えば、あなたのスウィフトクラスの名前がObjective-Cで支持されない文字を含むならば、あなたはObjective-Cで使うために代わりの名前を提供することができます。

source: For example, if you compile the code below using swift -D DEBUG_LOGGING to set the DEBUG_LOGGING conditional compilation flag, the compiler includes the code in the body of the conditional complication block.
ja: 例えば、あなたが下記のコードをswift -D DEBUG_LOGGINGを使ってコンパイルしてDEBUG_LOGGING条件コンパイルフラグを設定するならば、コンパイラはそのコードを条件コンパイルブロックの本文の中に含めます。

source: For example, in Swift code, you can pass a String value to an Objective-C method declared to take an NSString parameter.
ja: 例えば、スウィフトコードにおいて、あなたはあるString値を、NSStringパラメータをとるように宣言されたObjective-Cメソッドに渡すことができます。

source: For example, in the code listing below, the first and second lines are not executed because the count property and the character(at:) method do not exist on an NSDate object.
ja: 例えば、下記のコード出力において、最初と２番目の行が実行されません、なぜなら、countプロパティとcharacter(at:)メソッドはNSDateオブジェクトには存在しないからです。

source: For example, information that may be helpful, but isn’t essential for troubleshooting errors should be logged at the Info level.
ja: 例えば、助けとなるかもしれない、しかしエラーを解決するのに必須ではない情報は、Info水準でログされるべきです。

source: For example, suppose the C function above does not retain the CFString object before returning it.
ja: 例えば、上のC関数がCFStringオブジェクトを、それを返す前に保持しないと思ってください。

source: For example, the NSFileManager instance method URL(for:in:appropriateForURL:create:) returns a URL in the specified search path and domain, or produces an error if an appropriate URL does not exist and cannot be created.
ja: 例えば、NSFileManagerのインスタンスメソッドURL(for:in:appropriateForURL:create:)は指定された検索パスとドメインにおけるURLを返すか、または適切なURLが存在せず作成もできないならばエラーを生成します。

source: For example, the NSJSONReadingOptions option set is imported as JSONSerialization.ReadingOptions.
ja: 例えば、NSJSONReadingOptionsオプションセットはJSONSerialization.ReadingOptionsとしてインポートされます。

source: For example, the UIImage(contentsOfFile:) initializer can fail to initialize a UIImage object if an image file doesn’t exist at the provided path.
ja: 例えば、UIImage(contentsOfFile:)イニシャライザは、与えられたパスでファイルが存在しないならば、UIImageオブジェクトを初期化するのに失敗する可能性があります。

source: For example, the setsockopt(_:_:_:_:_:) function can specify a timeval value as a receive timeout option (SO_RCVTIMEO) for a socket by passing a pointer to that value and the length of that value:
ja: 例えば、setsockopt(_:_:_:_:_:)関数は、あるtimeval値を、受信時間切れオプション（SO_RCVTIMEO）としてあるソケットに対して指定することが、その値へのポインタとその値の長さを渡すことによって可能です：

source: For example, the NSCoder method decodeObjectOfClass(_:forKey:) uses Swift generics to provide a stronger type signature.
ja: 例えば、NSCoderのメソッドdecodeObjectOfClass(_:forKey:)は、スウィフト総称体を使うことでより強力な型シグネチャを提供します。

source: For example, the requestWhenInUseAuthorization method is only available to instances of CLLocationManager starting in iOS 8.0 and macOS 10.10:
ja: 例えば、requestWhenInUseAuthorizationメソッドは、CLLocationManagerのインスタンスに対してiOS 8.0およびmacOS 10.10からのみ利用可能です：

source: For example, the timeval structure in Darwin has a size and stride of 16 and an alignment of 8:
ja: 例えば、Darwinにおけるtimeval構造体は、16のサイズとストライドおよび8のアラインメントを持ちます：

source: For example, the C enumeration below is declared using the NS_ENUM macro.
ja: 例えば、以下のC列挙はNS_ENUMマクロを使って宣言されます。

source: For example, the constant definition #define FADE_ANIMATION_DURATION 0.35 can be better expressed in Swift with let FADE_ANIMATION_DURATION = 0.35.
ja: 例えば、定数定義#define FADE_ANIMATION_DURATION 0.35は、スウィフトにおいてよりよく表されることがlet FADE_ANIMATION_DURATION = 0.35でできます。

source: For example, the following C enumeration is not declared using the NS_ENUM macro:
ja: 例えば、以下のC列挙はNS_ENUMマクロを使って宣言されません。

source: For example, the following Swift code declares a class with an outlet, an outlet collection, and an action:
ja: 例えば、以下のスウィフトコードは、１つのアウトレット、１つのアウトレット接続、そして１つのアクションを持つクラスを宣言します：

source: For example, the following code compiles without a compiler warning, but triggers an error at runtime:
ja: 例えば、以下のコードは警告なしにコンパイルします、しかし実行時にエラーの引き金となります：

source: For example, the fully qualified name of a Swift class named DataManager in a framework named MyFramework is MyFramework.DataManager.
ja: 例えば、MyFrameworkと命名されるあるフレームワークのDataManagerと命名されるあるスウィフトクラスの完全修飾名は、MyFramework.DataManagerです。

source: For example, the most common form of a localized string in an app may only need a localization key and a comment:
ja: 例えば、アプリにおける最も一般的な形式の現地語化文字列は、現地語キーとコメントを必要とするだけでしょう：

source: For example, to use Foundation APIs from a Swift file, add the following import statement to the top of the file:
ja: 例えば、Foundation APIをスウィフトファイルから利用するには、以下のインポート文をその ファイルの一番上に加えてください：

source: For example, using these APIs would be appropriate if you need to implement a class that uses the target-action design pattern in its interface, like NSResponder does.
ja: 例えば、これらのAPIの使用は、もしあなたがそれのインターフェイスにおいてターゲット-アクション・デザインパターンを使うクラスを実装する必要があるならば適切でしょう、NSResponderがするように。

source: For example, when you create a document–based Mac app, you provide the name of your NSDocument subclass in your app’s Info.plist file.
ja: 例えば、あなたがドキュメントベースのMacアプリを作成しているとき、あなたは、あなたのNSDocumentサブクラスの名前をあなたのアプリのInfo.plistファイルにおいて提供しなければなりません。

source: For example, whereas in Objective-C you would call this factory method like this:
ja: 例えば、Objective-Cではあなたはこのクラスファクトリメソッドこのように呼び出しますが：

source: For example, whereas in Objective-C you would do this:
ja: 例えば、Objective-Cではあなたがこうするのに対して：

source: For example, you can assign an object of any class type to a constant or variable of AnyObject type and reassign a variable to an object of a different type.
ja: 例えば、あなたはどんなクラス型のオブジェクトでもAnyObject型の定数や変数に代入できます、そしてある変数を異なる型のオブジェクトへ再度代入できます。

source: For example, you can extend the UIBezierPath class to create a simple Bézier path with an equilateral triangle, based on a provided side length and starting point.
ja: 例えば、あなたはUIBezierPathクラスを拡張して、二等辺三角形を使った単純な「ベジェ」パスを作成するようにできます、それは提供された辺長と開始点に基づきます。

source: For example, you can mark a property called enabled to have a getter named isEnabled in Objective-C like this:
ja: 例えば、あなたはenabledと呼ばれるあるプロパティを、以下のように印してObjective-CにおいてisEnabledと名前をつけられるゲッターを持つようにできます：

source: For example, you can set the textColor and text properties of a UITextField object with the following code:
ja: 例えば、あなたはあるUITextFieldオブジェクトのtextColorとtextプロパティを設定するにの以下のコードを使うことができます：

source: For example, you can use a buffer pointer for efficent processing and communication of data between apps and services.
ja: たとえば、あなたはアプリとサービス間での効率の良いデータの処理および通信のためにバッファポインタを使うことができます。

source: For example, you can use the \Animal.name key-path expression to access the name property of the Animal class shown below.
ja: 例えば、あなたは\Animal.nameキーパス式を使って、下で示すAnimalクラスのnameプロパティにアクセスできます。

source: For example, you see this behavior when an optional is passed to an Objective-C API that takes a nonnull id and when an array of optional items ([T?]) is bridged to an NSArray.
ja: 例えば、あなたはこの挙動を、あるオプショナルが非null idをとるObjective-C APIに渡される時、およびオプショナル項目（[T?]）からなる配列がNSArrayへブリッジされる時に見ます。

source: For example:
ja: 例えば：

source: For framework targets, only declarations with the public or open modifier appear in the generated header.
ja: フレームワークターゲットでは、publicまたはopen修飾子を持つ宣言だけが生成ヘッダの中に現れます。

source: For functions and methods, this process affects the types of their arguments and return values.
ja: 関数とメソッドに対して、このプロセスは、それらの引数と戻り値の型に影響を及ぼします。

source: For information about encoding and decoding more complex custom types, see Encoding and Decoding Custom Types.
ja: より複雑なカスタム型のエンコードおよびデコードについての情報として、Encoding and Decoding Custom Typesを見てください。

source: For information about when the @objc attribute is implicitly added, see Declaration Attributes in The Swift Programming Language (Swift 4).
ja: @objc属性が暗黙的に加えられる場合についての情報として、宣言属性をスウィフトプログラミング言語（Swift 4）で見てください。

source: For information on product module naming, see Naming Your Product Module.
ja: 製品モジュールに名前をつけることに関する情報のために、あなたの製品モジュールに名をつけるを見てください。

source: For information on using Swift from Objective-C code, see Using Swift from Objective-C.
ja: Objective-Cコードからスウィフトを使うことに関する情報のために、スウィフトをObjective-Cから使うを見てください。

source: For instance, an Objective-C method that takes one or more pointer arguments could be refined in Swift to return a tuple of values.
ja: 例えば、１つ以上のポインタ引数を取るObjective-Cメソッドが改良されてスウィフトにおいてタプル値を返すようにできます。

source: For instructions, see Importing Code from Within the Same App Target.
ja: 手順指示のために、コードを同じアプリターゲットからインポートするを見てください。

source: For methods that take more than one argument, you can create an undo operation using an NSInvocation, which invokes the method with arguments that effectively revert the app to its previous state:
ja: １つ以上の引数を取るメソッドのために、あなたはNSInvocationを使って取り消し操作を作成することができます、それはアプリをそれの前の状態に効果的に戻す引数を使ってそのメソッドを呼び出します：

source: For more information about encoding and decoding JSON, see Using JSON with Custom Types.
ja: JSONのエンコードおよびデコードについてのさらなる情報として、Using JSON with Custom Typesを見てください。

source: For more information about implementing comparison logic, see Object comparison in Cocoa Core Competencies.
ja: 比較ロジックの実装についての更なる情報として、Object comparisonをCocoa Core Competenciesで見てください。

source: For more information about implementing your own deinitializers, see Deinitializers in The Swift Programming Language (Swift 4).
ja: あなた自身のデイニシャライザを実装することについての更なる情報として、デイニシャライザをスウィフトプログラミング言語（Swift 4）でみてください。

source: For more information about implementing your own initializers, see Initializers in The Swift Programming Language (Swift 4).
ja: あなた自身のイニシャライザを実装することについての更なる情報として、イニシャライザをスウィフトプログラミング言語（Swift 4）でみてください。

source: For more information about optionals, see Optionals in The Swift Programming Language (Swift 4).
ja: オプショナルについての更なる情報として、オプショナルをスウィフトプログラミング言語（Swift 4）において見てください。

source: For more information about specifiying platform availability, see Declaration Attributes in The Swift Programming Language (Swift 4).
ja: プラットホーム利用可能性を指定することについての更なる情報として、宣言属性をThe Swift Programming Language (Swift 4)で見てください。

source: For more information about the unified logging system, see Logging.
ja: 統合ログシステムについてのさらなる情報として、Loggingを見てください。

source: For more information about value types, see Classes and Structures in The Swift Programming Language (Swift 4), and WWDC 2015 session 414 Building Better Apps with Value Types in Swift.
ja: 値型についてのさらなる情報として、クラスと構造体をスウィフトプログラミング言語 (Swift 4)で、そしてWWDC 2015 セッション 414 より良いアプリをスウィフトの値型で作り上げるを見てください。

source: For more information about what you can access from Objective-C and how the Swift interface is imported, see Swift Type Compatibility.
ja: あなたがObjective-Cからアクセスできることとスウィフトインタへフェイスがインポートされる方法についての更なる情報として、スウィフト型互換性を見てください。

source: For more information on dynamic, see Requiring Dynamic Dispatch.
ja: dynamicに関数さらなる情報として、動的なディスパッチを要求するを見てください。

source: For more information on @objc, see Swift Type Compatibility.
ja: @objcの詳細については、スウィフト型互換性を見てください。

source: For more information on access-level modifiers, see Access Control in The Swift Programming Language (Swift 4).
ja: アクセス水準修飾子に関する更なる情報のために、アクセス制御をスウィフトプログラミング言語（Swift 4）で見てください。

source: For more information on key paths, see Keys and Key Paths.
ja: 新しいキーパスについてのさらなる情報として、キーとキーパスを見てください。

source: For more information on using Objective-C in Swift, see Interacting with Objective-C APIs.
ja: Objective-Cをスウィフトにおいて使うことに関するさらなる情報のためにObjective-C APIとの相互作用を見てください。

source: For more information on using Swift in Objective-C, see Swift and Objective-C in the Same Project.
ja: Objective-Cでスウィフトを使うことの詳細については、同じプロジェクト中のスウィフトとObjective-Cを見てください。

source: For more information, see Lazy Stored Properties in The Swift Programming Language (Swift 4).
ja: 更なる情報として、遅延保存プロパティをスウィフトプログラミング言語（Swift 4）で見てください。

source: For more information, see Ownership Policy in Memory Management Programming Guide for Core Foundation.
ja: 更なる情報のために、所有者方針をコアファウンデーションのためのメモリ管理プログラミングガイドで見てください。

source: For more information, see Protocols in The Swift Programming Language (Swift 4).
ja: さらなる情報として、プロトコルをスウィフトプログラミング言語（Swift 4）で見てください。

source: For more information, see Resolving Strong Reference Cycles for Closures in The Swift Programming Language (Swift 4).
ja: 更なる情報として、クロージャのための強い参照循環の解消をスウィフトプログラミング言語（Swift 4）で見てください。

source: For more information, see Type Attributes in The Swift Programming Language (Swift 4).
ja: 更なる情報としては、型属性をスウィフトプログラミング言語（Swift 4）において見てください。

source: For more information, see Type Casting in The Swift Programming Language (Swift 4).
ja: さらなる情報として、型キャストをスウィフトプログラミング言語（Swift 4）で見てください。

source: For more information, see Type Properties in The Swift Programming Language (Swift 4).
ja: 更なる情報として、型プロパティをスウィフトプログラミング言語（Swift 4）で見てください。

source: For more information, see Attributes.
ja: 詳細は、属性を見てください。

source: For more information, see Attributes in The Swift Programming Language (Swift 4).
ja: 詳細は、属性をスウィフトプログラミング言語（Swift 4）で見てください。

source: For more information, see Properties in The Swift Programming Language (Swift 4).
ja: 詳細は、プロパティをスウィフトプログラミング言語（Swift 4）で見てください。

source: For more information, see AnyHashable.
ja: 詳細は、AnyHashableを見てください。

source: For more information, see MemoryLayout.
ja: 詳細は、MemoryLayoutを見てください。

source: For more information, see Advanced Memory Management Programming Guide.
ja: さらなる情報は、Advanced Memory Management Programming Guideを見てください。

source: For more information, see Internationalization and Localization Guide.
ja: さらなる情報として、インターナショナライゼーションとローカリゼーションのガイド（Apple訳有り）を見てください。

source: For more information, see Undo Architecture.
ja: 更なる情報としてUndo Architectureを見てください。

source: For more information, see Interacting with Objective-C APIs.
ja: 詳細は、Objective-C APIとの相互作用を見てください。

source: For more information, see Working with Cocoa Frameworks.
ja: 詳細は、ココアフレームワークを扱うを見てください。

source: For more information, see Writing Swift Classes and Protocols with Objective-C Behavior.
ja: 詳細は、スウィフトのクラスとプロトコルをObjective-C挙動で書くを見てください。

source: For objects that are loaded from Storyboards or archived to disk using the NSUserDefaults or NSKeyedArchiver classes, you must provide a full implementation of this initializer.
ja: ストーリーボードからロードされるかディスクにNSUserDefaultsやNSKeyedArchiverクラスを使ってアーカイブされるオブジェクトに対して、あなたはこのイニシャライザの完全な実装を提供しなければなりません。

source: For pointers to untyped, raw memory, the following mappings apply:
ja: 型無しの、生のメモリへのポインタに対して、以下のマッピングを適用します：

source: For properties in Swift, you can create an undo operation in the willSet observer using self as the target, the corresponding Objective-C setter as the selector, and the current value of the property as the object:
ja: スウィフトでのプロパティに対して、あなたは取消操作をwillSetオブザーバにおいて作成することがselfをtargetとして、対応Objective-Cセッターをselectorとして、そしてプロパティの現在の値をobjectとして使って可能です：

source: For return types, variables, and arguments, the following mappings apply:
ja: 戻り型、変数、そして引数のために、以下のマッピングが適用されます：

source: For this reason, preprocessor directives are not imported in Swift.
ja: この理由のために、プリプロセッサ指令は、スウィフトにインポートされません。

source: For this reason, you should almost never need to use a bridged reference type directly in your own code.
ja: この理由のために、あなたはブリッジ参照型を直接にあなた自身のコードにおいて使う必要はほとんどないはずです。

source: For types, the process of importing can have the following effects:
ja: 型のために、インポートのプロセスは、以下の影響を与えることができます：

source: For values that require additional setup beyond initialization, you can assign the default value of the property to a self-evaluating closure that returns a fully-initialized value:
ja: 初期化を越えて更なる準備が必要な値に対して、あなたはプロパティの省略時の値を得る仕事を、完全初期化された値を返すある自己評価するクロージャに任せることができます：

source: Forward declarations of Swift classes and protocols can only be used as types for method and property declarations.
ja: スウィフトのクラスとプロトコルの前方宣言は、ただメソッドおよびプロパティ宣言の型として使われることができるだけです。

source: Foundation
ja: ファウンデーション

source: Foundation classes often declare enumeration or constant types.
ja: Foundationクラスは、しばしば列挙や定数型を宣言します。

source: From here, you can start experimenting by writing Swift code in the app delegate or a new Swift file you create by choosing File > New > File > (iOS, watchOS, tvOS, or macOS) > Source > Swift.
ja: ここから、あなたはアプリデリケートまたは「ファイル」>「新規」>「ファイル」>（iOS、watchOS、tvOS、またはmacOS）>「ソース」>「Swift」を選んで作成する新規スウィフトファイルにおいてスウィフトコードを書くことで実験を始めることができます。

source: Function
ja: 関数

source: Function Pointers
ja: 関数ポインター

source: Functions
ja: 関数

source: Generics
ja: 総称体

source: Getting Started
ja: 初めに

source: Given the following Objective-C declarations:
ja: 以下のObjective-C宣言を与えられたとして：

source: Global Constants
ja: グローバルな定数

source: Global constants defined in C and Objective-C source files are automatically imported by the Swift compiler as Swift global constants.
ja: CとObjective-Cソース・ファイルにおいて定義されるグローバル定数は、スウィフトコンパイラによってスウィフトのグローバル定数として自動的にインポートされます。

source: Global variables defined in Swift
ja: スウィフトにおいて定義されるグローバル変数

source: Hashing
ja: ハッシュ化

source: Here are the equivalent Swift initializer declarations:
ja: ここに同等のスウィフトイニシャライザ宣言があります：
